texts = {
    0: 'Добро пожаловать в Миллион-Бот — инструмент самоорганизации мирного гражданского сопротивления.',
    1: 'Ведите имя пользователя',
    2: 'Ведите код приглашения',
    3: '*Миллион-Бот*\n'
       '– это инструмент самоорганизации мирного гражданского сопротивления. В нем регистрируются люди, готовые участвовать в мирном протесте, но только при условии, что он будет действительно большим и, следовательно, относительно безопасным.\n'
       'Распространение Бота происходит через приглашения: зарегистрироваться может лишь человек, приглашенный уже зарегистрированным. Первые приглашения раздавали создатели проекта.\n'
       'Когда зарегистрируется достаточное число людей, Миллион-Бот объявит виртуальную репетицию акции. Она нужна для анонимной верификации участников и защиты от ботов и троллей. Если в виртуальной репетиции примет участие достаточное число настоящих живых людей, Миллион-Бот объявит всероссийскую протестную акцию и выдаст список мест сбора по городам.\n'
       'Миллион-Бот делает особый акцент на безопасности и анонимности участников. Поэтому он не собирает никаких личных данных, таких как, например, IP-адрес, геолокация или имейл. После регистрации и последующих взаимодействий с Ботом участники могут удалять чат с ним со своих телефонов, уничтожая таким образом последние “улики”.\n'
       'Миллион-Бот – это современный прозрачный open-source проект. Его создатели будут рады любой обратной связи. С нами можно анонимно  связаться через гитхаб [https://github.com/MisterBearclaw/million_bot](https://github.com/MisterBearclaw/million_bot), либо послав сообщение после регистрации в Боте.',
    5: 'Приглашение с таким кодом не найдено.',
    6: 'Это приглашение уже использовано. Если это были вы, попробуйте войти. Если вы потеряли доступ к логину'
       ' или паролю - я никак не могу вам помочь из соображений безопасности. Ваш логин виден тому, кто дал вам '
       'приглашение.',
    7: 'Приумайте имя пользователя (логин). '
       'В целях вашей безопасности, сделайте его несвязанным с вашими ФИО, имейл-адресом, '
       'и другими персональными данными. Обязательно запишите его!',
    8: 'Отлично! Теперь придумайте пароль. Запишите его!',
    9: 'Это имя пользователя уже занято. Попробуйте еще раз.',
    10: 'Спасибо! Повторите пожалуйста пароль.',
    11: 'Добро пожаловать, вы вошли в систему!',
    12: 'Пароли не совпали! Придумайте пожалуйста пароль.',
    13: 'Такое имя пользователя в базе не зарегистрировано.',
    14: 'Введите пароль.',
    15: 'Пароль не совпадает. Попробуйте еще раз.',
    19: 'Вы хотите сменить пароль?',
    20: 'Введите новый пароль',
    21: 'Пожалуйста повторите пароль',
    22: 'Введённые пароли не совпали. Пожалуйста введите новый пароль',
    23: 'Введите название города или населённого пункта, в котором вы готовы выйти на митинг, когда придёт время',
    24: 'Город изменён. Спасибо.',
    25: 'Пароль изменён. Пожалуйста, не найдейтесь на вашу память! Обязательно, запишите пароль!',
    26: 'Прошу прощения за недоверие, но вы точно человек?',
    27: 'Ответ неправильный',
    28: 'Превышен лимит регистраций',
    29: 'Вы больше не хотите или не можете быть частью мирного гражданского сопротивления в России?\n'
        'Для подтверждения удаления аккаунта напишите в ответ слово "удалить"',
    30: 'Ваш аккаунт был удалён',
    31: 'Включён режим широковещания. Ваше следующее сообщение будет отослано всем!',
    34: 'В нашей системе нет населённого пункта с таким названием. Пожалуйста, проверьте правописание. Если вы '
        'уверены в названии населённого пункта и хотели бы выйти на протест именно в нём, воспользуйтесь, '
        'пожалуйста, функцией обратной связи. ',
    35: 'Я ознакомился / ознакомилась с принципом работы Миллион-Бота в разделе “Подробности”. '
        'Я согласен / согласна с политическими требованиями, понимаю условия объявления акции и принцип распространения Миллион-Бота от человека к человеку.',
    36: 'Я согласен / согласна раз в неделю заходить в свой "аккаунт" и готова / готов принять участие в виртуальной репетиции и реальной акции, '
        'которые будут объявлены при наступлении условий из раздела “Подробности”.',
    37: 'Я согласен / согласна в течение следующей недели постараться найти среди тех, кому я доверяю, двух людей, которые хотели бы зарегистрироваться тут.',
    38: '*Требования участников акции*\n '
        ' 1. 21 сентября 2022 года, через полгода после начала масштабного вторжения России на территорию Украины, президент принял решение провести частичную мобилизацию граждан РФ. Мы не согласны, что обычные граждане России должны умирать ради иллюзорных целей на чужой земле. Мы не хотим, чтобы жены становились вдовами, а дети - росли без отцов ради сомнительных геополитических игр власть предержащих, какими бы “оправданными” и “вынужденными” ни были их действия. *Мы требуем отменить частичную мобилизацию и оставить обычных граждан в покое.*\n'
        ' 2. За более чем двадцать лет политика президента В. В. Путина сделала Россию страной-изгоем, развязавшей крупномасштабную войну на Европейском континенте в XXI веке и угрожающей всему миру ядерным катаклизмом. Упадок промышленности и экономики, политические репрессии, лишение граждан прав и свобод, травля независимых политиков и СМИ, нечестные и непрозрачные “выборы” - все это лишает Россию надежды на будущее современной процветающей демократической страны. Мы любим нашу страну и не теряем надежды на светлое будущее, и поэтому *требуем отставки президента и назначение новых выборов.*\n'
        ' 3. Прекрасное будущее для России могут построить только люди. И самые смелые из этих людей - те, кто не боялись выступать против преступной политики власти, сейчас либо сидят в тюрьме, либо преследуются по различным нелепым уголовным делам. Мы считаем, что нельзя сажать людей за их политические/религиозные/какие-бы-то-ни-было-еще взгляды. С ними нужно спорить и дискутировать, если не согласны. А не сажать. Поэтому мы *требуем освободить политических заключенных*, в соответствие со [списком Правозащитного Центра Мемориал](https://memohrc.org/ru/pzk-list). \n'
        ' 4. Война в Украине уже привела к небывалым разрушениям и смерти сотен тысяч людей, как военных, так и мирных граждан, как россиян, так и украинцев. После мобилизации количество горя и страдания, вызванных войной, возрастет неоднократно. К тому же эта война привела к глобальному экономическому, энергетическому и гуманитарному кризису, последствия от которого нам всем еще долго предстоит ощущать. Наконец, из-за этой войны вся планета висит на волоске от ядерного катаклизма. Война - это самое страшное, на что способен человек. *Мы требуем немедленно остановить боевые действия в Украине и вывести войска с украинской территории, определенной на момент 20.02.2022, т.е. до признания Россией суверенитета ЛНР и ДНР. Нет войне!*',
    39: 'Тем, кого вы пригласили разрешён вход без пароля в течении следующих пяти минут',
    40: 'Пользователь, пригласивший Вас, разрешил вам разовый вход без пароля. Пожалуйста, введите новый пароль.',
    41: '*Зачем нужна эта акция?*\n'
        'Один, даже очень большой, митинг, конечно, не гарантирует немедленного достижения наших политических требований, но позволит нам увидеть, как нас много и поверить в свои силы. Этот митинг должен дать старт всероссийской кампании гражданского сопротивления невиданной численности, которая приведет нас в мирное, свободное и счастливое будущее.',
    42: '*Безопасность*\n'
        'Миллион-Бот не хранит никаких личных данных -- только логин, пароль и город, который указывают участники при регистрации. Миллион-Бот не определяет ни их геопозицию, ни IP-адрес. Даже если вся база данных Бота будет украдена прокремлевскими хакерами (чего мы, естественно, постараемся избежать), это не будет нести никакой опасности для зарегистрировавшихся. \n'
        'Мы также рекомендуем участникам удалять чат с Ботом после каждого входа в аккаунт, чтобы он не мог быть обнаружен при возможной проверке телефона.',
    43: '*В каком случае будет объявлена акция?*\n'
        'Миллион-Бот суммирует числа участников в городах, где зарегистрировалось не менее 4% населения города. Если эта сумма составляет не менее 4% населения России, Миллион-Бот объявляет виртуальную репетицию.\n' 
        'Затем Миллион-Бот определяет города, в которых в виртуальной репетиции поучаствовало не менее 2% жителей города. Если сумма участников виртуальных репетиций в таких городах оказывается не менее 2% населения страны, Миллион-Бот объявляет реальную акцию в соответствующих городах.\n'  
        'Вот несколько примеров абсолютных цифр: 2% жителей Волгограда – это примерно 20 000 человек, 2% жителей Екатеринбурга – примерно 30 000, Санкт-Петербурга – 108 000, Москвы – 253 000. Два процента от населения России – это, примерно, 2 910 000 человек.\n'
        'Такой непростой критерий необходим, чтобы при общей многочисленности всероссийской акции, обеспечить многочисленность и безопасность митинга в каждом отдельном городе-участнике.\n',
    45: 'В нашей системе нет населённого пункта с таким названием. Пожалуйста, проверьте правописание.',
    46: '*Да столько народу никогда не наберется!*\n'
        'Да, может, и не наберется. Миллион-Бот не является инструментом агитации. Мы, конечно, надеемся, что наше общество уже в обозримом будущем захочет жить свободно и счастливо, но если для достижения критической численности потребуются долгие годы, значит так тому и быть.\n'
        'Одна из особенностей Миллион-Бота – это способ его распространения от человека к человеку. Вместо того, чтобы агитировать людей "сверху вниз", как это делают политики с трибуны, Миллион-Бот предлагает людям самим его распространять. Каждый участник получает два приглашения и просьбу их раздать. Таким образом, состоится ли акция или нет зависит не от харизмы и популярности конкретного политика, а от того, насколько этого хотят сами граждане страны.',
    47: '*Что такое виртуальная репетиция?*\n'
        'При достижении достаточной численности участников (см. раздел “В каком случае будет объявлена акция?”), Миллион-Бот объявит виртуальную репетицию. Зайдя в ваш аккаунт в объявленный день и час, вы получите ссылку на сайт виртуальной репетиции. Там вам будет предложено вновь вбить ваши логин и пароль и доказать, что вы не робот. После этого вы увидите на экране поле, на котором появится ваш аватар (в виде очень маленького человечка) и аватары всех других людей, пришедших на репетицию: такой "вид на митинг сверху".\n'
        'Репетиция будет продолжаться определенное время, в течение которого вам будет предложено выполнять некоторые действия, например, менять цвет вашего человечка конкретным образом. Так мы узнаем, каким аккаунтам соответствует настоящий живой и активный человек, а каким одиноко лежащий телефон, купленный троллю за бюджетные деньги. Таким образом мы выявим и отсеем аккаунты, созданные одним единственным троллем со многих девайсов. Это, конечно, не будет означать, что троллей не останется: каждый тролль все еще сможет активно участвовать в репетиции по крайней мере с одного телефона. Тем не менее мы считаем, что число троллей будет пренебрежимо мало по сравнению с числом честно зарегистрировавшихся.',
    48: '*А что делать с троллями?*\n'
        'Скорее всего, со временем в нашей системе появятся прокремлевские тролли, однако их число будет пренебрежимо мало по сравнению с числом честных граждан по следующим причинам:\n'
        ' 1. Только человек, приглашенный другим участником, может зарегистрироваться в Боте. Каждый зарегистрировавшийся получает только два приглашения. Первые приглашения раздавали создатели Бота. Для того чтобы в системе появились тролли, один из нас должен сильно ошибиться в том, кого он пригласил. Это, конечно же, не исключено, но вероятность этого не слишком велика.\n'
        ' 2. С одного Телеграм-аккаунта невозможно зарегистрироваться в Боте больше одного раза. Один тролль, конечно, может получить много телефонов и сим-карт и зарегестрироваться много раз, однако, такие аккаунты будут отсеяны на виртуальной репетиции. Таким образом число ложных аккаунтов будет ограничено числом людей, готовых быть троллями.',
    50: '*Процедура восстановления пароля*\n'
        'Поскольку в целях безопасности Миллион-Бот не знает о вас ничего, включая имейл, он не может использовать стандартную процедуру восстановления пароля. Поэтому регистрируясь, пожалуйста, запишите ваши логин и пароль на бумажку! Не полагайтесь на вашу память. Если вы все же не записали пароль и забыли его, вы можете попросить пригласившего вас человека зайти в его аккаунт → Мои приглашения → Разрешить приглашенным входить без пароля в течение 5 минут. В течение 5 минут вы сможете войти в свой аккаунт, введя один только логин. Вам сразу же будет предложено придумать новый пароль. На этот раз, пожалуйста, запишите его! Если же вы забудете логин, восстановление будет невозможно.',
    51: '*Почему мирное гражданское сопротивление работает?*\n'
        'За XX и XXI века в разных странах мира произошло несколько сотен масштабных кампаний мирного гражданского сопротивления [1]. Вообще-то, поскольку в среднем по планете уровень прав и свобод людей остается довольно низким [2], протест – довольно частое явление в жизни общества. При этом после многих из этих кампаний (более трети за последнее десятилетие [3]) происходят изменения в соответствующей стране. Являются ли мирный протест причиной этих изменений? Однозначно ответить трудно. В истории невозможно поставить прямой эксперимент, чтобы установить причинно-следственные связи и отличить их от простого совпадения, поэтому доказать, что именно мирное сопротивление приводит к изменению жизни в стране, крайне трудно. Возможно, то, что изменения произошли после массовых мирных протестов, – просто совпадение, и всегда существует некая другая причина. Однако, поскольку таких примеров сотни, существование скрытых причин в каждом случае кажется маловероятным, а соответствующее объяснение – слегка конспирологическим. К тому же, стоит отметить, что авторитарные режимы всегда стараются подавлять мирное сопротивление, доказывая тем самым его потенциальную эффективность. Если оно неэффективно, зачем с ним бороться? Таким образом, мы можем утверждать, что мирное гражданское сопротивление,  работает и нередко приводит к изменениям в стране.\n'
        'Существует по крайней мере одно крупномасштабное исследование, анализирующее причины успеха мирного протеста [4]. В этом исследовании авторы сравнили итоги нескольких сотен ненасильственных и насильственных кампаний и пришли к выводу, что мирное сопротивление достигает своей цели более, чем в два раза чаще, чем вооруженное -3-, -4-. Принимая результаты этого исследования, можно утверждать, что мирный протест является более эффективным инструментом смены режима, чем вооруженное восстание.\n'
        'Наконец, может казаться, что если победить авторитарный режим, то станет только хуже. Так, например, случилось после исламской революции в Иране, когда на смену успешно смещенному шаху пришло еще более авторитарное и кровавое правительство. Действительно, так иногда бывает, однако, все же гораздо чаще происходит обратное. Как показано в еще одном подробном исследовании на эту тему, в странах вслед за успешными крупномасштабными ненасильственными кампаниями в среднем происходит рост уровня политических и гражданских свобод -5-. \n'
        'Всем, желающим подробно разобраться в этой теме, советуем вступить в телеграм-канал [https://t.me/stronger_than_violence](https://t.me/stronger_than_violence), посвященный истории и механизмам мирного гражданского сопротивления: \n\n'
        'Ссылки: \n'
        ' -1- Erica Chenoweth & Christopher Wiley Shay (2020). *List of Campaigns in NAVCO 1.3*, [https://doi.org/10.7910/DVN/ON9XND](https://doi.org/10.7910/DVN/ON9XND), Harvard Dataverse\n\n'
        ' -2- Sarah Repucci & Amy Slipowitz (2022). *The Global Expansion  of Authoritarian Rule.* Freedom in the World report. [https://freedomhouse.org/report/freedom-world/2022/global-expansion-authoritarian-rule](https://freedomhouse.org/report/freedom-world/2022/global-expansion-authoritarian-rule) \n\n'
        ' -3- Erica Chenoweth (2020). *The Future of Nonviolent Resistance.* Journal of Democracy, vol. 31, no. 3, July 2020, pp. 69-84. \n\n'
        ' -4- Erica Chenoweth & Maria Stephan (2011). *Why civil resistance works: The strategic logic of nonviolent conflict.*\n\n'
        ' -5- Adrian Karatnycky & Peter Ackerman (2005). *How Freedom Is Won: From Civic Resistance to Durable Democracy.* Freedom house study.',
    'safety_logout': 'Из соображений безопастности ваш сеанс был завершён. Пожалуйста войдите еще раз.',
    'thanks_for_inviting':  'У Вас не осталось неиспользованных приглашений. Спасибо за то, что вы пригласили друзей!',
    'dont_forget_to_invite': 'Пожалуйста, не забудьте приласить ваших друзей и знакомых! Не дайте цепочке разорваться '
                             'на вас! ',
    'write_down_reminder': 'Пожалуйста, не надейтесь на вашу память! Запишите логин и пароль! Если вы забудете логин, '
                           'восстановление будет невозможно. Если вы забудете пароль, восстановление будет возможно '
                           'только с помощью пригласившего вас человека.',
    'child_left': 'К сожалению, один из людей, которых Вы пригласили, удалил свой аккаунт, либо его аккаунт был удален '
                  'из-за неучастия в Виртуальной репетиции. Из-за этого ваше приглашение можно использовать снова.'
                  ' Прошу вас найти еще одного человека среди ваших друзей, родственников и знакомых и пригласить его'
                  ' зарегестрироваться.',
    'sons_not_inviting': 'Один или несколько людей приглашённых Вами пока что не исползовали свои инвайты: {}. Напомните им пожалуйста об этом. Это важно!',
    'btn_about_1': 'Общие принципы',
    'btn_about_2': 'Зачем нужна эта акция?',
    'btn_about_3': 'Требования участников акции',
    'btn_about_4': 'В каком случае будет объявлена акция?',
    'btn_about_5': 'Да столько народу никогда не наберется!',
    'btn_about_6': 'Что такое виртуальная репетиция?',
    'btn_about_7': 'А что делать с троллями?',
    'btn_about_8': 'Безопасность',
    'btn_about_9': 'Процедура восстановления пароля',
    'btn_about_10': 'Почему мирное гражданское сопротивление работает?',
    'btn_back': 'Назад',
}
