texts = {
    0: 'Добро пожаловать в Миллион-Бот — инструмент самоорганизации мирного гражданского сопротивления.',
    1: 'Ведите имя пользователя',
    2: 'Ведите код приглашения',
    3: '*Общие положения*\n'
       'Тут будет простыня текста про то что мы вообще такое делаем и как оно работает. Мартин, Кирилл, Аня, напишите '
       'её пожалуйста ',
    5: 'Приглашение с таким кодом не найдено.',
    6: 'Это приглашение уже использовано. Если это были вы, попробуйте войти. Если вы потеряли доступ к логину'
       ' или паролю - я никак не могу вам помочь из соображений безопасности. Ваш логин виден тому, кто дал вам '
       'приглашение.',
    7: 'Приумайте имя пользователя (логин). '
       'В целях вашей безопасности, сделайте его несвязанным с вашими ФИО, имейл-адресом, '
       'и другими персональными данными. Обязательно запишите его!',
    8: 'Отлично! Теперь придумайте пароль. Запишите его!',
    9: 'Это имя пользователя уже занято. Попробуйте еще раз.',
    10: 'Спасибо! Повторите пожалуйста пароль.',
    11: 'Добро пожаловать, вы вошли в систему!',
    12: 'Пароли не совпали! Придумайте пожалуйста пароль.',
    13: 'Такое имя пользователя в базе не зарегистрировано.',
    14: 'Введите пароль.',
    15: 'Пароль не совпадает. Попробуйте еще раз.',
    19: 'Вы хотите сменить пароль?',
    20: 'Введите новый пароль',
    21: 'Пожалуйста повторите пароль',
    22: 'Введённые пароли не совпали. Пожалуйста введите новый пароль',
    23: 'Введите название города или населённого пункта, в котором вы готовы выйти на митинг, когда придёт время',
    24: 'Город изменён. Спасибо.',
    25: 'Пароль изменён. Пожалуйста, не найдейтесь на вашу память! Обязательно, запишите пароль!',
    26: 'Прошу прощения за недоверие, но вы точно человек?',
    27: 'Ответ неправильный',
    28: 'Превышен лимит регистраций',
    29: 'Вы больше не хотите или не можете быть частью мирного гражданского сопротивления в России?\n'
        'Для подтверждения удаления аккаунта напишите в ответ слово "удалить"',
    30: 'Ваш аккаунт был удалён',
    31: 'Включён режим широковещания. Ваше следующее сообщение будет отослано всем!',
    34: 'В нашей системе нет населённого пункта с таким названием. Пожалуйста, проверьте правописание. Если вы '
        'уверены в названии населённого пункта и хотели бы выйти на протест именно в нём, воспользуйтесь, '
        'пожалуйста, функцией обратной связи. ',
    35: 'Я ознакомился / ознакомилась с принципом работы Миллион-Бота в разделе “Подробности”. '
        'Я согласен / согласна с политическими требованиями, понимаю условия объявления акции и принцип распространения Миллион-Бота от человека к человеку.',
    36: 'Я согласен / согласна раз в неделю заходить в свой "аккаунт" и готова / готов принять участие в виртуальной репетиции и реальной акции, '
        'которые будут объявлены при наступлении условий из раздела “Подробности”.',
    37: 'Я согласен / согласна в течение следующей недели постараться найти среди тех, кому я доверяю, двух людей, которые хотели бы зарегистрироваться тут.',
    38: 'Требуем:\n 1. Кота Путину в печёнки!\n 2. Оторвать Слуцкому ... ноги! \n 3. Скормить Соловьёва Киселёву!',
    39: 'Тем, кого вы пригласили разрешён вход без пароля в течении следующих пяти минут',
    40: 'Пользователь, пригласивший Вас, разрешил вам разовый вход без пароля. Пожалуйста, введите новый пароль.',
    41: '*Про безопасность*\n'
       'Тут будет простыня текста про то что мы вообще такое делаем и как оно работает. Мартин, Кирилл, Аня, напишите '
       'её пожалуйста ',
    42: '*Про доверие*\n'
       'Тут будет простыня текста про то что мы вообще такое делаем и как оно работает. Мартин, Кирилл, Аня, напишите '
       'её пожалуйста ',
    43: '*Про низовое распространение*\n'
       'Тут будет простыня текста про то что мы вообще такое делаем и как оно работает. Мартин, Кирилл, Аня, напишите '
       'её пожалуйста ',
    'safety_logout': 'Из соображений безопастности ваш сеанс был завершён. Пожалуйста войдите еще раз.',
    'thanks_for_inviting':  'У Вас не осталось неиспользованных приглашений. Спасибо за то, что вы пригласили друзей!',
    'dont_forget_to_invite': 'Пожалуйста, не забудьте приласить ваших друзей и знакомых! Не дайте цепочке разорваться '
                             'на вас! ',
    'btn_about_1': 'Общие принципы',
    'btn_about_2': 'Безопасность',
    'btn_about_3': 'Доверие',
    'btn_about_4': 'Низовое распространение',
    'btn_back': 'Назад',
}
